// *++
//
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   mmStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell iomod command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"
#langdef   fra "Français"

#string STR_IOMOD_UNKNOWN_ACCESS       #language eng  "%hs: Unknown access type %hs\n"

#string STR_IOMOD_INVALID_WIDTH        #language eng  "%hs: Invalid data width\n"

#string STR_IOMOD_ADDRESS_NOT_ALIGNED  #language eng  "%hs: Data address %H0x%X%N not aligned %hd\n"

#string STR_IOMOD_HANDLE_PCI           #language eng  "%hs: Handle PciRootBridgeIO protocol error - %r"

#string STR_IOMOD_IO_ADDRESS           #language eng  "%hs: IO address out of range 0 - 0xFFFF\n"

#string STR_IOMOD_HMMIO                #language eng  "%HMMIO%N"

#string STR_IOMOD_HIO                  #language eng  "%HIO%N"

#string STR_IOMOD_HPCI                 #language eng  "%HPCI%N"

#string STR_IOMOD_HMEM                 #language eng  "%HMEM%N"

#string STR_IOMOD_ADDRESS              #language eng  "  0x%016lx : 0x"

#string STR_IOMOD_BUFFER_2             #language eng  "%02x"

#string STR_IOMOD_BUFFER_4             #language eng  "%04x"

#string STR_IOMOD_BUFFER_8             #language eng  "%08x"

#string STR_IOMOD_BUFFER_16            #language eng  "%016lx"

#string STR_IOMOD_IO_ADDRESS_2         #language eng  "\n%hs: IO address out of range\n"

#string STR_IOMOD_ERROR                #language eng  "\n ^ Error\n"

#string STR_IOMOD_READ_MEM_ERROR       #language eng  "%hs: Read mem error\n"

#string STR_HELPINFO_MM_SYNTAX         #language eng  "MM Address [Value] [-w 1|2|4|8] [-MMIO | -MEM | -IO | -PCI] [-n]\n"

#string STR_HELPINFO_MM_LINEHELP       #language eng  "Displays or modifies MEM/IO/PCI"

#string STR_HELPINFO_MM_VERBOSEHELP    #language eng  "Displays or modifies MEM/IO/PCI.\n"
                                                      "\n"
                                                      "MM Address [Value] [-w 1|2|4|8] [-MMIO | -MEM | -IO | -PCI] [-n]\n"
                                                      "\n"
                                                      "    Address  - Start address of MMIO or MEM or IO or PCI\n"
                                                      "    Value    - The value to write\n"
                                                      "    -MMIO    - Memory Mapped IO Address type\n"
                                                      "    -MEM     - Memory Address type\n"
                                                      "    -IO      - IO Address type\n"
                                                      "    -PCI     - PCI Configuration Space Address type\n"
                                                      "               (Address format: 000000ssbbddffrr)\n"
                                                      "               ss    - SEG\n"
                                                      "               bb    - bus\n"  
                                                      "               dd    - Device\n"
                                                      "               ff    - Func\n"  
                                                      "               rr    - Register\n"
                                                      "    -w       - Unit size accessed in bytes\n"
                                                      "               1    - 1 byte\n"
                                                      "               2    - 2 bytes\n"
                                                      "               4    - 4 bytes\n"
                                                      "               8    - 8 bytes\n"
                                                      "    -n       - Non-interactive mode\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. If no address type is specified, 'MEM' type is the default.\n"
                                                      "    2. If '-w' flag is specified, unit size 1 byte is the default.\n"
                                                      "    3. If 'Value' parameter is specified, option '-n' will be used\n"
                                                      "       automatically. In this case, this command will write this value to\n"
                                                      "       specified address in non-interactive mode. If without 'Value' parameter\n"
                                                      "       specified, only the current contents in the address are displayed.\n"
                                                      "    4. When address type is PCI type, the 'Address' should follow the format of\n"
                                                      "       PCI Configuration Space Address - 0x000000ssbbddffrr. User can use 'PCI'\n"
                                                      "       command to get the address for a specified device. It is listed in the\n"
                                                      "       PCI configuration space dump information, like\n"
                                                      "       \"[EFI 0x000000ssbbddffxx]\".\n"
                                                      "    5. In interactive mode, type a hex value to modify, 'q' or '.' to exit. If\n"
                                                      "       option '-n' is specified, it will run in non-interactive mode, which can\n"
                                                      "       be used inside of a batch file so that mm command can be called from the\n"
                                                      "       batch file without user's intervention.\n"
                                                      "    6. Not all PCI configuration register locations are writable, so when\n"
                                                      "       accessing these locations, it will not do read-modify write, will only\n"
                                                      "       write the value posted.\n"
                                                      "    7. The 'Address' parameter should align the boundary of the specified\n"
                                                      "       width.\n"
                                                      "    8. Not all address is safe enough to access. Access to any improper address\n"
                                                      "       can bring unexpected result.\n"
                                                      "\n"    
                                                      "Examples:\n"
                                                      "  * To display or modify memory from 0x1b07288, width=1 byte, Interactive mode:\n"
                                                      "    fs0:\\> mm 1b07288\n"
                                                      "    MEM  0x0000000001B07288 : 0x6D >\n"
                                                      "    MEM  0x0000000001B07289 : 0x6D >\n"
                                                      "    MEM  0x0000000001B0728A : 0x61 > 80\n"
                                                      "    MEM  0x0000000001B0728B : 0x70 > q\n"
                                                      "\n"
                                                      "    fs0:\\> mm 1b07288\n"
                                                      "    MEM  0x0000000001B07288 : 0x6D >\n"
                                                      "    MEM  0x0000000001B07289 : 0x6D >\n"
                                                      "    MEM  0x0000000001B0728A : 0x80 >        *Modified\n"
                                                      "    MEM  0x0000000001B0728B : 0x70 > q\n"
                                                      "\n"  
                                                      "  * Modifies memory from 0x1b07288, width = 2 bytes, Interactive mode:\n"
                                                      "    Shell> mm 1b07288 -w 2\n"
                                                      "    MEM  0x0000000001B07288 : 0x6D6D >\n"
                                                      "    MEM  0x0000000001B0728A : 0x7061 > 55aa\n"
                                                      "    MEM  0x0000000001B0728C : 0x358C > q\n"
                                                      "\n"    
                                                      "    Shell> mm 1b07288 -w 2\n"
                                                      "    MEM  0x0000000001B07288 : 0x6D6D >\n"
                                                      "    MEM  0x0000000001B0728A : 0x55AA >      *Modified\n"
                                                      "    MEM  0x0000000001B0728C : 0x358C > q\n"
                                                      "\n"    
                                                      "  * Operates with width = 4 bytes, type is IO:\n"
                                                      "    Shell> mm 80 -w 4 -IO\n"
                                                      "    IO  0x0000000000000080 : 0x000000FE >\n"
                                                      "    IO  0x0000000000000084 : 0x00FF5E6D > q\n"
                                                      "\n"
                                                      "  * To display PCI configuration space, ss=00, bb=00, ss=00, ff=00, rr=00:\n"
                                                      "    Shell> mm 0000000000 -PCI\n"
                                                      "    PCI  0x000000000000000 : 0x86 >\n"
                                                      "    PCI  0x000000000000001 : 0x80 >\n"
                                                      "    PCI  0x000000000000002 : 0x30 >\n"
                                                      "    PCI  0x000000000000003 : 0x11 >\n"
                                                      "    PCI  0x000000000000004 : 0x06 >\n"
                                                      "    PCI  0x000000000000005 : 0x00 > q\n"
                                                      "  * These contents can also be displayed by 'PCI 00 00 00'.\n"
                                                      "\n"  
                                                      "  * To modify memory in non-interactive mode:\n"
                                                      "    Shell> mm 80 52 -w 1 -IO\n"
                                                      "    Shell> mm 80 -w 1 -IO\n"
                                                      "    IO  0x0000000000000080 : 0x52 > FE    *Modified\n"
                                                      "    IO  0x0000000000000081 : 0xFF >\n"
                                                      "    IO  0x0000000000000082 : 0x00 >\n"
                                                      "    IO  0x0000000000000083 : 0x00 >\n"
                                                      "    IO  0x0000000000000084 : 0x6D >\n"
                                                      "    IO  0x0000000000000085 : 0x5E >\n"
                                                      "    IO  0x0000000000000086 : 0xFF >\n"
                                                      "    IO  0x0000000000000087 : 0x00 > q\n"




